def solution(letter):

  letter = letter.split(" ")          # 문자열 letter을 split을 이용하여 공백을 이용하여 나누어서 리스트로 저장함.

  answer = ''
  morse = {
     '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
    '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
    '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
    '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
    '-.--':'y','--..':'z'}
  for i in letter:                        # for문을 이용하여 모스부호를 영어로 변환.
    if i in morse:                        # if문을 이용하여 i가 morse에 포함된다면 answer += morse[i].
      answer += morse[i]

  return answer

print(solution("--. .-. . .- - .--. --- .-- . .-. -.-. --- -- . ... --. .-. . .- - .-. . ... .--. --- -. ... .. -... .. .-.. .. - -.--"))
                            # 제한사항에 맞추어 제한된 길이에 맞고, 내가 인상깊었던 말을 예시로 출력.